# OptionValueOutOfRange Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DebugTabBindingFailures..::..OptionValueOutOfRange Property
BuiltInFailures..::..DebugTabBindingFailures Class See Also
---
Value out of range for Options enum.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OptionValueOutOfRange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OptionValueOutOfRange As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OptionValueOutOfRange {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DebugTabBindingFailures Class
Autodesk.Revit.DB Namespace